//=========== TASK 1 ===================================================================================================
/*
Задать температуру в градусах по Цельсию.
Вывести в alert соответствующую температуру в градусах по Фаренгейту.
Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, 
Tc – температура по Цельсию
*/

const tempC = Number(prompt("Введите температуру в градусах Цельсия"));
const tempF = (9 / 5) * tempC + 32;

alert('Температура по Фаренгейту: ' + tempF);

//======================================================================================================================

//=========== TASK 2 ===================================================================================================
/*
Работа с переменными. Объявить две переменные: admin и name. 
Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
*/

let name = '';
let admin = '';

name = 'Василий';
admin = name;

console.log(admin);

//======================================================================================================================

//=========== TASK 3 ===================================================================================================
/*
Чему будет равно JS-выражение 1000 + "108"
*/

// Ответ: "1000108"

//======================================================================================================================

//=========== TASK 4 ===================================================================================================
/*
Самостоятельно разобраться с атрибутами тега script (async и defer)
*/

/*
async - загрузит скрипт и сразу начнет его исполнение
defer - загрузит скрипт и будет ждать пока не загрузиться весь документ, и только тогда начнет его выполнение
*/

//======================================================================================================================
